Section 2/CustomStudentSOAPService.txt

<?xml version="1.0" encoding="utf-8"?>   
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns="http://soap.sforce.com/schemas/class/StudentSoapService">
  <soapenv:Header>
     <SessionHeader>
        <sessionId>00D4W000000FDql!ARsAQAhGCZTQr7WdE7zORZ6eGoqRFKJoZLo7ofUKC6qUip3rt6QnXr9d4.Hzb07lCl4zt0jmpkbE5mjluIgdJ3lDXRhbDGga</sessionId>
     </SessionHeader>
  </soapenv:Header>
  <soapenv:Body>
     <getStudentById>
        <stdId>a004W00000aDb30QAC</stdId>
     </getStudentById>
  </soapenv:Body>
</soapenv:Envelope>